app/controllers/students_controller.rb

SELECT "camps".* FROM "camps"
---
  def set_camps
    @camps = Camp.all.sort_by { |c| c.name }